RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=142, bias=True)
    (1): ReLU6()
    (2): Linear(in_features=142, out_features=33, bias=True)
    (3): LogSigmoid()
    (4): Linear(in_features=33, out_features=74, bias=True)
    (5): Tanh()
    (6): Linear(in_features=74, out_features=6, bias=True)
    (7): SELU()
    (8): Linear(in_features=6, out_features=1, bias=True)
    (9): Sigmoid()
  )
)