RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=42, bias=True)
    (1): Hardtanh(min_val=-1.0, max_val=1.0)
    (2): Linear(in_features=42, out_features=31, bias=True)
    (3): LeakyReLU(negative_slope=0.01)
    (4): Linear(in_features=31, out_features=137, bias=True)
    (5): Softshrink(0.5)
    (6): Linear(in_features=137, out_features=15, bias=True)
    (7): ReLU6()
    (8): Linear(in_features=15, out_features=1, bias=True)
    (9): SELU()
  )
)