RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=168, bias=True)
    (1): ReLU6()
    (2): Linear(in_features=168, out_features=153, bias=True)
    (3): PReLU(num_parameters=1)
    (4): Linear(in_features=153, out_features=1, bias=True)
    (5): Tanh()
  )
)