RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=53, bias=True)
    (1): SiLU()
    (2): Linear(in_features=53, out_features=24, bias=True)
    (3): Hardtanh(min_val=-1.0, max_val=1.0)
    (4): Linear(in_features=24, out_features=79, bias=True)
    (5): Identity()
    (6): Linear(in_features=79, out_features=1, bias=True)
    (7): SiLU()
  )
)