RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=10, bias=True)
    (1): Mish()
    (2): Linear(in_features=10, out_features=20, bias=True)
    (3): Mish()
    (4): Linear(in_features=20, out_features=195, bias=True)
    (5): RReLU(lower=0.125, upper=0.3333333333333333)
    (6): Linear(in_features=195, out_features=9, bias=True)
    (7): Softsign()
    (8): Linear(in_features=9, out_features=1, bias=True)
    (9): Softplus(beta=1, threshold=20)
  )
)