RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=110, bias=True)
    (1): Sigmoid()
    (2): Linear(in_features=110, out_features=68, bias=True)
    (3): Hardsigmoid()
    (4): Linear(in_features=68, out_features=144, bias=True)
    (5): Tanh()
    (6): Linear(in_features=144, out_features=81, bias=True)
    (7): Tanh()
    (8): Linear(in_features=81, out_features=1, bias=True)
    (9): Tanhshrink()
  )
)