RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=25, bias=True)
    (1): RReLU(lower=0.125, upper=0.3333333333333333)
    (2): Linear(in_features=25, out_features=120, bias=True)
    (3): SELU()
    (4): Linear(in_features=120, out_features=87, bias=True)
    (5): Softsign()
    (6): Linear(in_features=87, out_features=1, bias=True)
    (7): RReLU(lower=0.125, upper=0.3333333333333333)
  )
)