RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=44, bias=True)
    (1): SELU()
    (2): Linear(in_features=44, out_features=16, bias=True)
    (3): Softplus(beta=1, threshold=20)
    (4): Linear(in_features=16, out_features=1, bias=True)
    (5): Hardswish()
  )
)