RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=91, bias=True)
    (1): Tanh()
    (2): Linear(in_features=91, out_features=100, bias=True)
    (3): ReLU6()
    (4): Linear(in_features=100, out_features=84, bias=True)
    (5): ReLU()
    (6): Linear(in_features=84, out_features=94, bias=True)
    (7): ReLU()
    (8): Linear(in_features=94, out_features=1, bias=True)
    (9): PReLU(num_parameters=1)
  )
)