RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=81, bias=True)
    (1): SELU()
    (2): Linear(in_features=81, out_features=89, bias=True)
    (3): Identity()
    (4): Linear(in_features=89, out_features=1, bias=True)
    (5): GELU(approximate='none')
  )
)