RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=99, bias=True)
    (1): Hardsigmoid()
    (2): Linear(in_features=99, out_features=82, bias=True)
    (3): Tanhshrink()
    (4): Linear(in_features=82, out_features=2, bias=True)
    (5): PReLU(num_parameters=1)
    (6): Linear(in_features=2, out_features=10, bias=True)
    (7): Tanhshrink()
    (8): Linear(in_features=10, out_features=1, bias=True)
    (9): GELU(approximate='none')
  )
)