RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=11, bias=True)
    (1): PReLU(num_parameters=1)
    (2): Linear(in_features=11, out_features=77, bias=True)
    (3): Hardtanh(min_val=-1.0, max_val=1.0)
    (4): Linear(in_features=77, out_features=1, bias=True)
    (5): Hardsigmoid()
  )
)