RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=12, bias=True)
    (1): SELU()
    (2): Linear(in_features=12, out_features=92, bias=True)
    (3): Hardsigmoid()
    (4): Linear(in_features=92, out_features=1, bias=True)
    (5): Sigmoid()
  )
)