RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=16, bias=True)
    (1): Tanhshrink()
    (2): Linear(in_features=16, out_features=135, bias=True)
    (3): ReLU6()
    (4): Linear(in_features=135, out_features=1, bias=True)
    (5): SELU()
  )
)