RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=71, bias=True)
    (1): ReLU6()
    (2): Linear(in_features=71, out_features=125, bias=True)
    (3): ReLU6()
    (4): Linear(in_features=125, out_features=54, bias=True)
    (5): LogSigmoid()
    (6): Linear(in_features=54, out_features=21, bias=True)
    (7): Tanhshrink()
    (8): Linear(in_features=21, out_features=1, bias=True)
    (9): Tanh()
  )
)