RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=121, bias=True)
    (1): ReLU()
    (2): Linear(in_features=121, out_features=60, bias=True)
    (3): Softsign()
    (4): Linear(in_features=60, out_features=28, bias=True)
    (5): LogSigmoid()
    (6): Linear(in_features=28, out_features=27, bias=True)
    (7): Hardswish()
    (8): Linear(in_features=27, out_features=1, bias=True)
    (9): ReLU()
  )
)