RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=95, bias=True)
    (1): ReLU6()
    (2): Linear(in_features=95, out_features=104, bias=True)
    (3): SiLU()
    (4): Linear(in_features=104, out_features=1, bias=True)
    (5): RReLU(lower=0.125, upper=0.3333333333333333)
  )
)