RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=125, bias=True)
    (1): RReLU(lower=0.125, upper=0.3333333333333333)
    (2): Linear(in_features=125, out_features=128, bias=True)
    (3): Softsign()
    (4): Linear(in_features=128, out_features=1, bias=True)
    (5): LogSigmoid()
  )
)