RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=10, bias=True)
    (1): Hardswish()
    (2): Linear(in_features=10, out_features=116, bias=True)
    (3): Tanhshrink()
    (4): Linear(in_features=116, out_features=17, bias=True)
    (5): Hardshrink(0.5)
    (6): Linear(in_features=17, out_features=1, bias=True)
    (7): Softsign()
  )
)