RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=159, bias=True)
    (1): Mish()
    (2): Linear(in_features=159, out_features=14, bias=True)
    (3): SELU()
    (4): Linear(in_features=14, out_features=12, bias=True)
    (5): SELU()
    (6): Linear(in_features=12, out_features=1, bias=True)
    (7): Tanhshrink()
  )
)