RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=175, bias=True)
    (1): Identity()
    (2): Linear(in_features=175, out_features=198, bias=True)
    (3): ReLU6()
    (4): Linear(in_features=198, out_features=1, bias=True)
    (5): Hardswish()
  )
)