RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=14, bias=True)
    (1): SiLU()
    (2): Linear(in_features=14, out_features=15, bias=True)
    (3): Mish()
    (4): Linear(in_features=15, out_features=16, bias=True)
    (5): SELU()
    (6): Linear(in_features=16, out_features=150, bias=True)
    (7): Tanh()
    (8): Linear(in_features=150, out_features=1, bias=True)
    (9): Hardsigmoid()
  )
)