RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=19, bias=True)
    (1): Hardshrink(0.5)
    (2): Linear(in_features=19, out_features=12, bias=True)
    (3): Sigmoid()
    (4): Linear(in_features=12, out_features=1, bias=True)
    (5): GELU(approximate='none')
  )
)