RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=131, bias=True)
    (1): Mish()
    (2): Linear(in_features=131, out_features=10, bias=True)
    (3): Softplus(beta=1, threshold=20)
    (4): Linear(in_features=10, out_features=1, bias=True)
    (5): Hardswish()
  )
)