RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=10, bias=True)
    (1): Hardtanh(min_val=-1.0, max_val=1.0)
    (2): Linear(in_features=10, out_features=17, bias=True)
    (3): Softsign()
    (4): Linear(in_features=17, out_features=8, bias=True)
    (5): SiLU()
    (6): Linear(in_features=8, out_features=169, bias=True)
    (7): Tanhshrink()
    (8): Linear(in_features=169, out_features=1, bias=True)
    (9): Hardsigmoid()
  )
)