RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=93, bias=True)
    (1): ELU(alpha=1.0)
    (2): Linear(in_features=93, out_features=95, bias=True)
    (3): RReLU(lower=0.125, upper=0.3333333333333333)
    (4): Linear(in_features=95, out_features=2, bias=True)
    (5): Hardshrink(0.5)
    (6): Linear(in_features=2, out_features=1, bias=True)
    (7): Hardtanh(min_val=-1.0, max_val=1.0)
  )
)