RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=13, bias=True)
    (1): Hardsigmoid()
    (2): Linear(in_features=13, out_features=14, bias=True)
    (3): Sigmoid()
    (4): Linear(in_features=14, out_features=12, bias=True)
    (5): CELU(alpha=1.0)
    (6): Linear(in_features=12, out_features=1, bias=True)
    (7): Softshrink(0.5)
  )
)