RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=9, bias=True)
    (1): ReLU6()
    (2): Linear(in_features=9, out_features=18, bias=True)
    (3): ReLU6()
    (4): Linear(in_features=18, out_features=190, bias=True)
    (5): Softsign()
    (6): Linear(in_features=190, out_features=1, bias=True)
    (7): GELU(approximate='none')
  )
)