RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=149, bias=True)
    (1): Softplus(beta=1, threshold=20)
    (2): Linear(in_features=149, out_features=18, bias=True)
    (3): ReLU()
    (4): Linear(in_features=18, out_features=153, bias=True)
    (5): ReLU()
    (6): Linear(in_features=153, out_features=10, bias=True)
    (7): Tanh()
    (8): Linear(in_features=10, out_features=1, bias=True)
    (9): Softsign()
  )
)