RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=107, bias=True)
    (1): RReLU(lower=0.125, upper=0.3333333333333333)
    (2): Linear(in_features=107, out_features=2, bias=True)
    (3): RReLU(lower=0.125, upper=0.3333333333333333)
    (4): Linear(in_features=2, out_features=14, bias=True)
    (5): Sigmoid()
    (6): Linear(in_features=14, out_features=1, bias=True)
    (7): LogSigmoid()
  )
)