RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=40, bias=True)
    (1): ELU(alpha=1.0)
    (2): Linear(in_features=40, out_features=32, bias=True)
    (3): Softsign()
    (4): Linear(in_features=32, out_features=90, bias=True)
    (5): ReLU()
    (6): Linear(in_features=90, out_features=41, bias=True)
    (7): SiLU()
    (8): Linear(in_features=41, out_features=1, bias=True)
    (9): ReLU()
  )
)