RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=12, bias=True)
    (1): Sigmoid()
    (2): Linear(in_features=12, out_features=12, bias=True)
    (3): ELU(alpha=1.0)
    (4): Linear(in_features=12, out_features=200, bias=True)
    (5): Softplus(beta=1, threshold=20)
    (6): Linear(in_features=200, out_features=1, bias=True)
    (7): SiLU()
  )
)