RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=19, bias=True)
    (1): RReLU(lower=0.125, upper=0.3333333333333333)
    (2): Linear(in_features=19, out_features=177, bias=True)
    (3): ReLU()
    (4): Linear(in_features=177, out_features=14, bias=True)
    (5): Identity()
    (6): Linear(in_features=14, out_features=130, bias=True)
    (7): Tanh()
    (8): Linear(in_features=130, out_features=1, bias=True)
    (9): Softsign()
  )
)