RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=74, bias=True)
    (1): Identity()
    (2): Linear(in_features=74, out_features=77, bias=True)
    (3): Hardswish()
    (4): Linear(in_features=77, out_features=146, bias=True)
    (5): SiLU()
    (6): Linear(in_features=146, out_features=68, bias=True)
    (7): Tanh()
    (8): Linear(in_features=68, out_features=1, bias=True)
    (9): Sigmoid()
  )
)