RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=147, bias=True)
    (1): SELU()
    (2): Linear(in_features=147, out_features=5, bias=True)
    (3): Mish()
    (4): Linear(in_features=5, out_features=197, bias=True)
    (5): Hardtanh(min_val=-1.0, max_val=1.0)
    (6): Linear(in_features=197, out_features=6, bias=True)
    (7): Tanh()
    (8): Linear(in_features=6, out_features=1, bias=True)
    (9): ReLU()
  )
)