RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=15, bias=True)
    (1): Mish()
    (2): Linear(in_features=15, out_features=189, bias=True)
    (3): Mish()
    (4): Linear(in_features=189, out_features=20, bias=True)
    (5): Mish()
    (6): Linear(in_features=20, out_features=1, bias=True)
    (7): RReLU(lower=0.125, upper=0.3333333333333333)
  )
)