RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=40, bias=True)
    (1): Softshrink(0.5)
    (2): Linear(in_features=40, out_features=10, bias=True)
    (3): Hardtanh(min_val=-1.0, max_val=1.0)
    (4): Linear(in_features=10, out_features=45, bias=True)
    (5): ELU(alpha=1.0)
    (6): Linear(in_features=45, out_features=12, bias=True)
    (7): CELU(alpha=1.0)
    (8): Linear(in_features=12, out_features=1, bias=True)
    (9): Mish()
  )
)