RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=120, bias=True)
    (1): Mish()
    (2): Linear(in_features=120, out_features=62, bias=True)
    (3): ReLU6()
    (4): Linear(in_features=62, out_features=38, bias=True)
    (5): ReLU()
    (6): Linear(in_features=38, out_features=1, bias=True)
    (7): Sigmoid()
  )
)