RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=112, bias=True)
    (1): PReLU(num_parameters=1)
    (2): Linear(in_features=112, out_features=87, bias=True)
    (3): GELU(approximate='none')
    (4): Linear(in_features=87, out_features=25, bias=True)
    (5): Tanhshrink()
    (6): Linear(in_features=25, out_features=141, bias=True)
    (7): Mish()
    (8): Linear(in_features=141, out_features=1, bias=True)
    (9): Sigmoid()
  )
)