RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=93, bias=True)
    (1): ReLU6()
    (2): Linear(in_features=93, out_features=91, bias=True)
    (3): Identity()
    (4): Linear(in_features=91, out_features=1, bias=True)
    (5): Identity()
  )
)