RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=124, bias=True)
    (1): ReLU()
    (2): Linear(in_features=124, out_features=59, bias=True)
    (3): Tanhshrink()
    (4): Linear(in_features=59, out_features=63, bias=True)
    (5): ReLU6()
    (6): Linear(in_features=63, out_features=104, bias=True)
    (7): Sigmoid()
    (8): Linear(in_features=104, out_features=1, bias=True)
    (9): SELU()
  )
)