RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=4, bias=True)
    (1): Softsign()
    (2): Linear(in_features=4, out_features=7, bias=True)
    (3): LogSigmoid()
    (4): Linear(in_features=7, out_features=116, bias=True)
    (5): PReLU(num_parameters=1)
    (6): Linear(in_features=116, out_features=116, bias=True)
    (7): Hardsigmoid()
    (8): Linear(in_features=116, out_features=1, bias=True)
    (9): SELU()
  )
)