RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=6, bias=True)
    (1): LeakyReLU(negative_slope=0.01)
    (2): Linear(in_features=6, out_features=2, bias=True)
    (3): SiLU()
    (4): Linear(in_features=2, out_features=1, bias=True)
    (5): ReLU6()
  )
)