RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=13, bias=True)
    (1): SELU()
    (2): Linear(in_features=13, out_features=183, bias=True)
    (3): Softsign()
    (4): Linear(in_features=183, out_features=12, bias=True)
    (5): RReLU(lower=0.125, upper=0.3333333333333333)
    (6): Linear(in_features=12, out_features=9, bias=True)
    (7): SELU()
    (8): Linear(in_features=9, out_features=1, bias=True)
    (9): Hardswish()
  )
)