RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=191, bias=True)
    (1): Tanhshrink()
    (2): Linear(in_features=191, out_features=103, bias=True)
    (3): ELU(alpha=1.0)
    (4): Linear(in_features=103, out_features=20, bias=True)
    (5): ELU(alpha=1.0)
    (6): Linear(in_features=20, out_features=8, bias=True)
    (7): LeakyReLU(negative_slope=0.01)
    (8): Linear(in_features=8, out_features=1, bias=True)
    (9): Identity()
  )
)