RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=17, bias=True)
    (1): Hardtanh(min_val=-1.0, max_val=1.0)
    (2): Linear(in_features=17, out_features=19, bias=True)
    (3): SELU()
    (4): Linear(in_features=19, out_features=17, bias=True)
    (5): LeakyReLU(negative_slope=0.01)
    (6): Linear(in_features=17, out_features=1, bias=True)
    (7): LeakyReLU(negative_slope=0.01)
  )
)