RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=81, bias=True)
    (1): Softplus(beta=1, threshold=20)
    (2): Linear(in_features=81, out_features=112, bias=True)
    (3): ReLU()
    (4): Linear(in_features=112, out_features=29, bias=True)
    (5): Identity()
    (6): Linear(in_features=29, out_features=1, bias=True)
    (7): Sigmoid()
  )
)