RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=179, bias=True)
    (1): SiLU()
    (2): Linear(in_features=179, out_features=70, bias=True)
    (3): ReLU6()
    (4): Linear(in_features=70, out_features=81, bias=True)
    (5): Identity()
    (6): Linear(in_features=81, out_features=1, bias=True)
    (7): ReLU()
  )
)