RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=130, bias=True)
    (1): SELU()
    (2): Linear(in_features=130, out_features=67, bias=True)
    (3): Softsign()
    (4): Linear(in_features=67, out_features=25, bias=True)
    (5): Hardswish()
    (6): Linear(in_features=25, out_features=1, bias=True)
    (7): Sigmoid()
  )
)