RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=91, bias=True)
    (1): LogSigmoid()
    (2): Linear(in_features=91, out_features=82, bias=True)
    (3): ReLU6()
    (4): Linear(in_features=82, out_features=1, bias=True)
    (5): Sigmoid()
  )
)