RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=142, bias=True)
    (1): Hardsigmoid()
    (2): Linear(in_features=142, out_features=129, bias=True)
    (3): LeakyReLU(negative_slope=0.01)
    (4): Linear(in_features=129, out_features=103, bias=True)
    (5): ReLU()
    (6): Linear(in_features=103, out_features=1, bias=True)
    (7): Sigmoid()
  )
)