RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=7, bias=True)
    (1): Hardtanh(min_val=-1.0, max_val=1.0)
    (2): Linear(in_features=7, out_features=11, bias=True)
    (3): ELU(alpha=1.0)
    (4): Linear(in_features=11, out_features=1, bias=True)
    (5): Mish()
  )
)