RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=13, bias=True)
    (1): Softplus(beta=1, threshold=20)
    (2): Linear(in_features=13, out_features=17, bias=True)
    (3): Hardsigmoid()
    (4): Linear(in_features=17, out_features=1, bias=True)
    (5): Sigmoid()
  )
)