RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=103, bias=True)
    (1): Mish()
    (2): Linear(in_features=103, out_features=9, bias=True)
    (3): CELU(alpha=1.0)
    (4): Linear(in_features=9, out_features=7, bias=True)
    (5): LogSigmoid()
    (6): Linear(in_features=7, out_features=1, bias=True)
    (7): Mish()
  )
)