RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=109, bias=True)
    (1): Hardtanh(min_val=-1.0, max_val=1.0)
    (2): Linear(in_features=109, out_features=50, bias=True)
    (3): Hardshrink(0.5)
    (4): Linear(in_features=50, out_features=1, bias=True)
    (5): RReLU(lower=0.125, upper=0.3333333333333333)
  )
)