RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=138, bias=True)
    (1): LeakyReLU(negative_slope=0.01)
    (2): Linear(in_features=138, out_features=15, bias=True)
    (3): ReLU()
    (4): Linear(in_features=15, out_features=95, bias=True)
    (5): Mish()
    (6): Linear(in_features=95, out_features=107, bias=True)
    (7): Hardswish()
    (8): Linear(in_features=107, out_features=1, bias=True)
    (9): Softshrink(0.5)
  )
)