RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=98, bias=True)
    (1): Softshrink(0.5)
    (2): Linear(in_features=98, out_features=42, bias=True)
    (3): Sigmoid()
    (4): Linear(in_features=42, out_features=1, bias=True)
    (5): LeakyReLU(negative_slope=0.01)
  )
)