RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=97, bias=True)
    (1): LeakyReLU(negative_slope=0.01)
    (2): Linear(in_features=97, out_features=123, bias=True)
    (3): SiLU()
    (4): Linear(in_features=123, out_features=91, bias=True)
    (5): SiLU()
    (6): Linear(in_features=91, out_features=1, bias=True)
    (7): Sigmoid()
  )
)