RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=137, bias=True)
    (1): Sigmoid()
    (2): Linear(in_features=137, out_features=69, bias=True)
    (3): LogSigmoid()
    (4): Linear(in_features=69, out_features=1, bias=True)
    (5): Sigmoid()
  )
)