RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=81, bias=True)
    (1): Mish()
    (2): Linear(in_features=81, out_features=51, bias=True)
    (3): LogSigmoid()
    (4): Linear(in_features=51, out_features=1, bias=True)
    (5): Sigmoid()
  )
)