RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=65, bias=True)
    (1): ReLU()
    (2): Linear(in_features=65, out_features=83, bias=True)
    (3): Hardswish()
    (4): Linear(in_features=83, out_features=19, bias=True)
    (5): Tanhshrink()
    (6): Linear(in_features=19, out_features=1, bias=True)
    (7): Sigmoid()
  )
)