RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=136, bias=True)
    (1): Hardswish()
    (2): Linear(in_features=136, out_features=79, bias=True)
    (3): RReLU(lower=0.125, upper=0.3333333333333333)
    (4): Linear(in_features=79, out_features=1, bias=True)
    (5): Sigmoid()
  )
)