RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=5, bias=True)
    (1): Tanh()
    (2): Linear(in_features=5, out_features=15, bias=True)
    (3): Hardsigmoid()
    (4): Linear(in_features=15, out_features=186, bias=True)
    (5): ReLU6()
    (6): Linear(in_features=186, out_features=1, bias=True)
    (7): CELU(alpha=1.0)
  )
)