RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=4, bias=True)
    (1): Softshrink(0.5)
    (2): Linear(in_features=4, out_features=86, bias=True)
    (3): ReLU6()
    (4): Linear(in_features=86, out_features=1, bias=True)
    (5): ReLU6()
  )
)