RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=7, bias=True)
    (1): SiLU()
    (2): Linear(in_features=7, out_features=2, bias=True)
    (3): Softsign()
    (4): Linear(in_features=2, out_features=4, bias=True)
    (5): Identity()
    (6): Linear(in_features=4, out_features=1, bias=True)
    (7): ReLU()
  )
)