RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=117, bias=True)
    (1): PReLU(num_parameters=1)
    (2): Linear(in_features=117, out_features=141, bias=True)
    (3): Hardswish()
    (4): Linear(in_features=141, out_features=6, bias=True)
    (5): GELU(approximate='none')
    (6): Linear(in_features=6, out_features=3, bias=True)
    (7): LeakyReLU(negative_slope=0.01)
    (8): Linear(in_features=3, out_features=1, bias=True)
    (9): Hardshrink(0.5)
  )
)