RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=100, bias=True)
    (1): Hardswish()
    (2): Linear(in_features=100, out_features=3, bias=True)
    (3): ReLU()
    (4): Linear(in_features=3, out_features=110, bias=True)
    (5): Sigmoid()
    (6): Linear(in_features=110, out_features=14, bias=True)
    (7): Hardtanh(min_val=-1.0, max_val=1.0)
    (8): Linear(in_features=14, out_features=1, bias=True)
    (9): ELU(alpha=1.0)
  )
)