RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=9, bias=True)
    (1): CELU(alpha=1.0)
    (2): Linear(in_features=9, out_features=10, bias=True)
    (3): SELU()
    (4): Linear(in_features=10, out_features=138, bias=True)
    (5): Tanh()
    (6): Linear(in_features=138, out_features=1, bias=True)
    (7): Identity()
  )
)