RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=136, bias=True)
    (1): GELU(approximate='none')
    (2): Linear(in_features=136, out_features=123, bias=True)
    (3): LeakyReLU(negative_slope=0.01)
    (4): Linear(in_features=123, out_features=1, bias=True)
    (5): ELU(alpha=1.0)
  )
)