RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=126, bias=True)
    (1): Tanhshrink()
    (2): Linear(in_features=126, out_features=130, bias=True)
    (3): Tanh()
    (4): Linear(in_features=130, out_features=79, bias=True)
    (5): Tanhshrink()
    (6): Linear(in_features=79, out_features=12, bias=True)
    (7): Hardshrink(0.5)
    (8): Linear(in_features=12, out_features=1, bias=True)
    (9): PReLU(num_parameters=1)
  )
)