RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=14, bias=True)
    (1): Softsign()
    (2): Linear(in_features=14, out_features=20, bias=True)
    (3): ReLU6()
    (4): Linear(in_features=20, out_features=20, bias=True)
    (5): SELU()
    (6): Linear(in_features=20, out_features=12, bias=True)
    (7): Hardsigmoid()
    (8): Linear(in_features=12, out_features=1, bias=True)
    (9): ReLU6()
  )
)