RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=6, bias=True)
    (1): SELU()
    (2): Linear(in_features=6, out_features=2, bias=True)
    (3): Mish()
    (4): Linear(in_features=2, out_features=127, bias=True)
    (5): SiLU()
    (6): Linear(in_features=127, out_features=1, bias=True)
    (7): Mish()
  )
)