RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=145, bias=True)
    (1): Mish()
    (2): Linear(in_features=145, out_features=12, bias=True)
    (3): GELU(approximate='none')
    (4): Linear(in_features=12, out_features=117, bias=True)
    (5): Mish()
    (6): Linear(in_features=117, out_features=1, bias=True)
    (7): ELU(alpha=1.0)
  )
)