RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=131, bias=True)
    (1): LogSigmoid()
    (2): Linear(in_features=131, out_features=127, bias=True)
    (3): Hardtanh(min_val=-1.0, max_val=1.0)
    (4): Linear(in_features=127, out_features=11, bias=True)
    (5): SiLU()
    (6): Linear(in_features=11, out_features=1, bias=True)
    (7): Hardshrink(0.5)
  )
)