RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=6, bias=True)
    (1): ReLU()
    (2): Linear(in_features=6, out_features=14, bias=True)
    (3): PReLU(num_parameters=1)
    (4): Linear(in_features=14, out_features=5, bias=True)
    (5): ELU(alpha=1.0)
    (6): Linear(in_features=5, out_features=149, bias=True)
    (7): ReLU6()
    (8): Linear(in_features=149, out_features=1, bias=True)
    (9): Tanhshrink()
  )
)