RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=151, bias=True)
    (1): LeakyReLU(negative_slope=0.01)
    (2): Linear(in_features=151, out_features=13, bias=True)
    (3): Identity()
    (4): Linear(in_features=13, out_features=1, bias=True)
    (5): CELU(alpha=1.0)
  )
)