RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=20, bias=True)
    (1): SiLU()
    (2): Linear(in_features=20, out_features=168, bias=True)
    (3): RReLU(lower=0.125, upper=0.3333333333333333)
    (4): Linear(in_features=168, out_features=13, bias=True)
    (5): GELU(approximate='none')
    (6): Linear(in_features=13, out_features=117, bias=True)
    (7): Tanh()
    (8): Linear(in_features=117, out_features=1, bias=True)
    (9): SiLU()
  )
)