RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=19, bias=True)
    (1): Softplus(beta=1, threshold=20)
    (2): Linear(in_features=19, out_features=13, bias=True)
    (3): GELU(approximate='none')
    (4): Linear(in_features=13, out_features=185, bias=True)
    (5): Mish()
    (6): Linear(in_features=185, out_features=1, bias=True)
    (7): Softsign()
  )
)