RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=114, bias=True)
    (1): Identity()
    (2): Linear(in_features=114, out_features=108, bias=True)
    (3): ReLU6()
    (4): Linear(in_features=108, out_features=1, bias=True)
    (5): GELU(approximate='none')
  )
)