RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=140, bias=True)
    (1): Tanhshrink()
    (2): Linear(in_features=140, out_features=90, bias=True)
    (3): Identity()
    (4): Linear(in_features=90, out_features=53, bias=True)
    (5): CELU(alpha=1.0)
    (6): Linear(in_features=53, out_features=19, bias=True)
    (7): ReLU6()
    (8): Linear(in_features=19, out_features=1, bias=True)
    (9): ReLU6()
  )
)