RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=105, bias=True)
    (1): Mish()
    (2): Linear(in_features=105, out_features=15, bias=True)
    (3): LeakyReLU(negative_slope=0.01)
    (4): Linear(in_features=15, out_features=187, bias=True)
    (5): Hardsigmoid()
    (6): Linear(in_features=187, out_features=144, bias=True)
    (7): CELU(alpha=1.0)
    (8): Linear(in_features=144, out_features=1, bias=True)
    (9): ReLU6()
  )
)