RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=171, bias=True)
    (1): SiLU()
    (2): Linear(in_features=171, out_features=171, bias=True)
    (3): LogSigmoid()
    (4): Linear(in_features=171, out_features=115, bias=True)
    (5): Hardsigmoid()
    (6): Linear(in_features=115, out_features=13, bias=True)
    (7): Hardshrink(0.5)
    (8): Linear(in_features=13, out_features=1, bias=True)
    (9): Softplus(beta=1, threshold=20)
  )
)