RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=146, bias=True)
    (1): ELU(alpha=1.0)
    (2): Linear(in_features=146, out_features=125, bias=True)
    (3): CELU(alpha=1.0)
    (4): Linear(in_features=125, out_features=181, bias=True)
    (5): ELU(alpha=1.0)
    (6): Linear(in_features=181, out_features=17, bias=True)
    (7): Tanhshrink()
    (8): Linear(in_features=17, out_features=1, bias=True)
    (9): Identity()
  )
)