RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=10, bias=True)
    (1): Hardsigmoid()
    (2): Linear(in_features=10, out_features=19, bias=True)
    (3): Softshrink(0.5)
    (4): Linear(in_features=19, out_features=13, bias=True)
    (5): Tanh()
    (6): Linear(in_features=13, out_features=1, bias=True)
    (7): Tanh()
  )
)