RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=136, bias=True)
    (1): LeakyReLU(negative_slope=0.01)
    (2): Linear(in_features=136, out_features=170, bias=True)
    (3): ReLU6()
    (4): Linear(in_features=170, out_features=19, bias=True)
    (5): ELU(alpha=1.0)
    (6): Linear(in_features=19, out_features=1, bias=True)
    (7): PReLU(num_parameters=1)
  )
)