RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=181, bias=True)
    (1): Sigmoid()
    (2): Linear(in_features=181, out_features=9, bias=True)
    (3): GELU(approximate='none')
    (4): Linear(in_features=9, out_features=102, bias=True)
    (5): PReLU(num_parameters=1)
    (6): Linear(in_features=102, out_features=1, bias=True)
    (7): SELU()
  )
)