RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=68, bias=True)
    (1): Hardswish()
    (2): Linear(in_features=68, out_features=134, bias=True)
    (3): Softplus(beta=1, threshold=20)
    (4): Linear(in_features=134, out_features=22, bias=True)
    (5): LogSigmoid()
    (6): Linear(in_features=22, out_features=1, bias=True)
    (7): RReLU(lower=0.125, upper=0.3333333333333333)
  )
)