RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=41, bias=True)
    (1): ReLU6()
    (2): Linear(in_features=41, out_features=122, bias=True)
    (3): ReLU()
    (4): Linear(in_features=122, out_features=1, bias=True)
    (5): Hardtanh(min_val=-1.0, max_val=1.0)
  )
)