RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=25, bias=True)
    (1): CELU(alpha=1.0)
    (2): Linear(in_features=25, out_features=77, bias=True)
    (3): ReLU6()
    (4): Linear(in_features=77, out_features=39, bias=True)
    (5): Softplus(beta=1, threshold=20)
    (6): Linear(in_features=39, out_features=1, bias=True)
    (7): ReLU()
  )
)