RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=176, bias=True)
    (1): LogSigmoid()
    (2): Linear(in_features=176, out_features=14, bias=True)
    (3): Tanh()
    (4): Linear(in_features=14, out_features=116, bias=True)
    (5): SELU()
    (6): Linear(in_features=116, out_features=7, bias=True)
    (7): GELU(approximate='none')
    (8): Linear(in_features=7, out_features=1, bias=True)
    (9): Hardswish()
  )
)