RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=16, bias=True)
    (1): CELU(alpha=1.0)
    (2): Linear(in_features=16, out_features=13, bias=True)
    (3): Softshrink(0.5)
    (4): Linear(in_features=13, out_features=14, bias=True)
    (5): Softplus(beta=1, threshold=20)
    (6): Linear(in_features=14, out_features=14, bias=True)
    (7): Softplus(beta=1, threshold=20)
    (8): Linear(in_features=14, out_features=1, bias=True)
    (9): Tanh()
  )
)