RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=191, bias=True)
    (1): Softsign()
    (2): Linear(in_features=191, out_features=122, bias=True)
    (3): Softsign()
    (4): Linear(in_features=122, out_features=1, bias=True)
    (5): Hardshrink(0.5)
  )
)