RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=4, bias=True)
    (1): Softsign()
    (2): Linear(in_features=4, out_features=1, bias=True)
    (3): Tanh()
    (4): Linear(in_features=1, out_features=3, bias=True)
    (5): Hardswish()
    (6): Linear(in_features=3, out_features=16, bias=True)
    (7): Hardsigmoid()
    (8): Linear(in_features=16, out_features=1, bias=True)
    (9): CELU(alpha=1.0)
  )
)