RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=91, bias=True)
    (1): CELU(alpha=1.0)
    (2): Linear(in_features=91, out_features=67, bias=True)
    (3): ELU(alpha=1.0)
    (4): Linear(in_features=67, out_features=51, bias=True)
    (5): Hardswish()
    (6): Linear(in_features=51, out_features=1, bias=True)
    (7): SiLU()
  )
)