RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=138, bias=True)
    (1): SiLU()
    (2): Linear(in_features=138, out_features=136, bias=True)
    (3): LogSigmoid()
    (4): Linear(in_features=136, out_features=19, bias=True)
    (5): LeakyReLU(negative_slope=0.01)
    (6): Linear(in_features=19, out_features=161, bias=True)
    (7): ReLU()
    (8): Linear(in_features=161, out_features=1, bias=True)
    (9): Tanh()
  )
)