RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=18, bias=True)
    (1): LogSigmoid()
    (2): Linear(in_features=18, out_features=6, bias=True)
    (3): Tanhshrink()
    (4): Linear(in_features=6, out_features=24, bias=True)
    (5): Tanh()
    (6): Linear(in_features=24, out_features=13, bias=True)
    (7): Sigmoid()
    (8): Linear(in_features=13, out_features=1, bias=True)
    (9): Softsign()
  )
)