RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=14, bias=True)
    (1): Hardtanh(min_val=-1.0, max_val=1.0)
    (2): Linear(in_features=14, out_features=42, bias=True)
    (3): PReLU(num_parameters=1)
    (4): Linear(in_features=42, out_features=59, bias=True)
    (5): Tanhshrink()
    (6): Linear(in_features=59, out_features=1, bias=True)
    (7): LeakyReLU(negative_slope=0.01)
  )
)