RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=47, bias=True)
    (1): SELU()
    (2): Linear(in_features=47, out_features=26, bias=True)
    (3): ReLU6()
    (4): Linear(in_features=26, out_features=43, bias=True)
    (5): SiLU()
    (6): Linear(in_features=43, out_features=1, bias=True)
    (7): CELU(alpha=1.0)
  )
)