RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=45, bias=True)
    (1): Hardshrink(0.5)
    (2): Linear(in_features=45, out_features=75, bias=True)
    (3): Softsign()
    (4): Linear(in_features=75, out_features=1, bias=True)
    (5): Softsign()
  )
)