RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=90, bias=True)
    (1): Identity()
    (2): Linear(in_features=90, out_features=115, bias=True)
    (3): Softshrink(0.5)
    (4): Linear(in_features=115, out_features=91, bias=True)
    (5): ReLU()
    (6): Linear(in_features=91, out_features=141, bias=True)
    (7): ELU(alpha=1.0)
    (8): Linear(in_features=141, out_features=1, bias=True)
    (9): Hardsigmoid()
  )
)