RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=91, bias=True)
    (1): Softshrink(0.5)
    (2): Linear(in_features=91, out_features=51, bias=True)
    (3): Identity()
    (4): Linear(in_features=51, out_features=43, bias=True)
    (5): ReLU6()
    (6): Linear(in_features=43, out_features=1, bias=True)
    (7): SiLU()
  )
)