RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=51, bias=True)
    (1): Hardtanh(min_val=-1.0, max_val=1.0)
    (2): Linear(in_features=51, out_features=70, bias=True)
    (3): Mish()
    (4): Linear(in_features=70, out_features=1, bias=True)
    (5): LeakyReLU(negative_slope=0.01)
  )
)