RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=88, bias=True)
    (1): Softsign()
    (2): Linear(in_features=88, out_features=63, bias=True)
    (3): RReLU(lower=0.125, upper=0.3333333333333333)
    (4): Linear(in_features=63, out_features=73, bias=True)
    (5): LogSigmoid()
    (6): Linear(in_features=73, out_features=1, bias=True)
    (7): Tanh()
  )
)