RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=90, bias=True)
    (1): CELU(alpha=1.0)
    (2): Linear(in_features=90, out_features=11, bias=True)
    (3): Mish()
    (4): Linear(in_features=11, out_features=1, bias=True)
    (5): Hardsigmoid()
  )
)