RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=83, bias=True)
    (1): LogSigmoid()
    (2): Linear(in_features=83, out_features=50, bias=True)
    (3): Softshrink(0.5)
    (4): Linear(in_features=50, out_features=68, bias=True)
    (5): Tanh()
    (6): Linear(in_features=68, out_features=61, bias=True)
    (7): RReLU(lower=0.125, upper=0.3333333333333333)
    (8): Linear(in_features=61, out_features=1, bias=True)
    (9): CELU(alpha=1.0)
  )
)