RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=20, bias=True)
    (1): Softplus(beta=1, threshold=20)
    (2): Linear(in_features=20, out_features=74, bias=True)
    (3): Softshrink(0.5)
    (4): Linear(in_features=74, out_features=96, bias=True)
    (5): ELU(alpha=1.0)
    (6): Linear(in_features=96, out_features=97, bias=True)
    (7): Hardswish()
    (8): Linear(in_features=97, out_features=1, bias=True)
    (9): SELU()
  )
)