RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=64, bias=True)
    (1): Mish()
    (2): Linear(in_features=64, out_features=10, bias=True)
    (3): RReLU(lower=0.125, upper=0.3333333333333333)
    (4): Linear(in_features=10, out_features=76, bias=True)
    (5): ELU(alpha=1.0)
    (6): Linear(in_features=76, out_features=1, bias=True)
    (7): Identity()
  )
)