RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=47, bias=True)
    (1): Mish()
    (2): Linear(in_features=47, out_features=94, bias=True)
    (3): Sigmoid()
    (4): Linear(in_features=94, out_features=1, bias=True)
    (5): LeakyReLU(negative_slope=0.01)
  )
)