RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=10, bias=True)
    (1): Tanh()
    (2): Linear(in_features=10, out_features=40, bias=True)
    (3): Sigmoid()
    (4): Linear(in_features=40, out_features=53, bias=True)
    (5): SiLU()
    (6): Linear(in_features=53, out_features=36, bias=True)
    (7): Identity()
    (8): Linear(in_features=36, out_features=1, bias=True)
    (9): Softshrink(0.5)
  )
)