RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=36, bias=True)
    (1): Softshrink(0.5)
    (2): Linear(in_features=36, out_features=48, bias=True)
    (3): LogSigmoid()
    (4): Linear(in_features=48, out_features=1, bias=True)
    (5): Tanhshrink()
  )
)