RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=57, bias=True)
    (1): Tanhshrink()
    (2): Linear(in_features=57, out_features=63, bias=True)
    (3): Softsign()
    (4): Linear(in_features=63, out_features=54, bias=True)
    (5): Tanh()
    (6): Linear(in_features=54, out_features=69, bias=True)
    (7): Hardswish()
    (8): Linear(in_features=69, out_features=1, bias=True)
    (9): CELU(alpha=1.0)
  )
)