RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=21, bias=True)
    (1): LeakyReLU(negative_slope=0.01)
    (2): Linear(in_features=21, out_features=79, bias=True)
    (3): ReLU()
    (4): Linear(in_features=79, out_features=44, bias=True)
    (5): Softplus(beta=1, threshold=20)
    (6): Linear(in_features=44, out_features=9, bias=True)
    (7): Sigmoid()
    (8): Linear(in_features=9, out_features=1, bias=True)
    (9): Softsign()
  )
)