RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=62, bias=True)
    (1): Hardswish()
    (2): Linear(in_features=62, out_features=200, bias=True)
    (3): Tanhshrink()
    (4): Linear(in_features=200, out_features=1, bias=True)
    (5): CELU(alpha=1.0)
  )
)