RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=64, bias=True)
    (1): Identity()
    (2): Linear(in_features=64, out_features=53, bias=True)
    (3): Softsign()
    (4): Linear(in_features=53, out_features=53, bias=True)
    (5): Softshrink(0.5)
    (6): Linear(in_features=53, out_features=60, bias=True)
    (7): Hardswish()
    (8): Linear(in_features=60, out_features=1, bias=True)
    (9): LeakyReLU(negative_slope=0.01)
  )
)