RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=168, bias=True)
    (1): ReLU6()
    (2): Linear(in_features=168, out_features=175, bias=True)
    (3): LeakyReLU(negative_slope=0.01)
    (4): Linear(in_features=175, out_features=6, bias=True)
    (5): ReLU()
    (6): Linear(in_features=6, out_features=178, bias=True)
    (7): SiLU()
    (8): Linear(in_features=178, out_features=1, bias=True)
    (9): SiLU()
  )
)