RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=25, bias=True)
    (1): Softshrink(0.5)
    (2): Linear(in_features=25, out_features=72, bias=True)
    (3): ReLU6()
    (4): Linear(in_features=72, out_features=1, bias=True)
    (5): Hardshrink(0.5)
  )
)