RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=11, bias=True)
    (1): Mish()
    (2): Linear(in_features=11, out_features=60, bias=True)
    (3): Softsign()
    (4): Linear(in_features=60, out_features=1, bias=True)
    (5): Tanhshrink()
  )
)