RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=13, bias=True)
    (1): LogSigmoid()
    (2): Linear(in_features=13, out_features=9, bias=True)
    (3): CELU(alpha=1.0)
    (4): Linear(in_features=9, out_features=122, bias=True)
    (5): Sigmoid()
    (6): Linear(in_features=122, out_features=1, bias=True)
    (7): Identity()
  )
)