RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=7, bias=True)
    (1): GELU(approximate='none')
    (2): Linear(in_features=7, out_features=176, bias=True)
    (3): ReLU()
    (4): Linear(in_features=176, out_features=145, bias=True)
    (5): PReLU(num_parameters=1)
    (6): Linear(in_features=145, out_features=1, bias=True)
    (7): ReLU6()
  )
)