RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=38, bias=True)
    (1): SELU()
    (2): Linear(in_features=38, out_features=9, bias=True)
    (3): SiLU()
    (4): Linear(in_features=9, out_features=53, bias=True)
    (5): Softshrink(0.5)
    (6): Linear(in_features=53, out_features=1, bias=True)
    (7): Sigmoid()
  )
)