RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=842, bias=True)
    (1): SELU()
    (2): Linear(in_features=842, out_features=871, bias=True)
    (3): ELU(alpha=1.0)
    (4): Linear(in_features=871, out_features=228, bias=True)
    (5): ELU(alpha=1.0)
    (6): Linear(in_features=228, out_features=432, bias=True)
    (7): SELU()
    (8): Linear(in_features=432, out_features=1, bias=True)
    (9): LeakyReLU(negative_slope=0.01)
  )
)