RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=6, bias=True)
    (1): LogSigmoid()
    (2): Linear(in_features=6, out_features=6, bias=True)
    (3): Tanh()
    (4): Linear(in_features=6, out_features=20, bias=True)
    (5): ReLU()
    (6): Linear(in_features=20, out_features=8, bias=True)
    (7): GELU(approximate='none')
    (8): Linear(in_features=8, out_features=1, bias=True)
    (9): Tanhshrink()
  )
)