RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=16, bias=True)
    (1): Identity()
    (2): Linear(in_features=16, out_features=59, bias=True)
    (3): SELU()
    (4): Linear(in_features=59, out_features=89, bias=True)
    (5): Tanhshrink()
    (6): Linear(in_features=89, out_features=1, bias=True)
    (7): Hardsigmoid()
  )
)