RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=13, bias=True)
    (1): Hardswish()
    (2): Linear(in_features=13, out_features=155, bias=True)
    (3): RReLU(lower=0.125, upper=0.3333333333333333)
    (4): Linear(in_features=155, out_features=103, bias=True)
    (5): Tanhshrink()
    (6): Linear(in_features=103, out_features=1, bias=True)
    (7): GELU(approximate='none')
  )
)