RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=54, bias=True)
    (1): Identity()
    (2): Linear(in_features=54, out_features=14, bias=True)
    (3): Hardswish()
    (4): Linear(in_features=14, out_features=78, bias=True)
    (5): LeakyReLU(negative_slope=0.01)
    (6): Linear(in_features=78, out_features=31, bias=True)
    (7): Softshrink(0.5)
    (8): Linear(in_features=31, out_features=1, bias=True)
    (9): Mish()
  )
)