RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=36, bias=True)
    (1): SiLU()
    (2): Linear(in_features=36, out_features=71, bias=True)
    (3): Softsign()
    (4): Linear(in_features=71, out_features=1, bias=True)
    (5): Softsign()
  )
)