RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=5, bias=True)
    (1): Softshrink(0.5)
    (2): Linear(in_features=5, out_features=18, bias=True)
    (3): SELU()
    (4): Linear(in_features=18, out_features=9, bias=True)
    (5): Softsign()
    (6): Linear(in_features=9, out_features=1, bias=True)
    (7): LogSigmoid()
  )
)