RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=87, bias=True)
    (1): Hardswish()
    (2): Linear(in_features=87, out_features=59, bias=True)
    (3): Softplus(beta=1, threshold=20)
    (4): Linear(in_features=59, out_features=58, bias=True)
    (5): Tanhshrink()
    (6): Linear(in_features=58, out_features=1, bias=True)
    (7): Hardswish()
  )
)