RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=44, bias=True)
    (1): ELU(alpha=1.0)
    (2): Linear(in_features=44, out_features=38, bias=True)
    (3): Softsign()
    (4): Linear(in_features=38, out_features=1, bias=True)
    (5): SELU()
  )
)