RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=66, bias=True)
    (1): Tanhshrink()
    (2): Linear(in_features=66, out_features=180, bias=True)
    (3): SELU()
    (4): Linear(in_features=180, out_features=75, bias=True)
    (5): Hardtanh(min_val=-1.0, max_val=1.0)
    (6): Linear(in_features=75, out_features=1, bias=True)
    (7): Hardswish()
  )
)