RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=199, bias=True)
    (1): RReLU(lower=0.125, upper=0.3333333333333333)
    (2): Linear(in_features=199, out_features=13, bias=True)
    (3): Softsign()
    (4): Linear(in_features=13, out_features=145, bias=True)
    (5): GELU(approximate='none')
    (6): Linear(in_features=145, out_features=1, bias=True)
    (7): LogSigmoid()
  )
)