RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=5, bias=True)
    (1): Tanhshrink()
    (2): Linear(in_features=5, out_features=10, bias=True)
    (3): GELU(approximate='none')
    (4): Linear(in_features=10, out_features=7, bias=True)
    (5): CELU(alpha=1.0)
    (6): Linear(in_features=7, out_features=10, bias=True)
    (7): Softplus(beta=1, threshold=20)
    (8): Linear(in_features=10, out_features=1, bias=True)
    (9): Mish()
  )
)