RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=52, bias=True)
    (1): Sigmoid()
    (2): Linear(in_features=52, out_features=57, bias=True)
    (3): GELU(approximate='none')
    (4): Linear(in_features=57, out_features=101, bias=True)
    (5): ELU(alpha=1.0)
    (6): Linear(in_features=101, out_features=1, bias=True)
    (7): Hardshrink(0.5)
  )
)