RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=188, bias=True)
    (1): RReLU(lower=0.125, upper=0.3333333333333333)
    (2): Linear(in_features=188, out_features=18, bias=True)
    (3): Hardswish()
    (4): Linear(in_features=18, out_features=9, bias=True)
    (5): GELU(approximate='none')
    (6): Linear(in_features=9, out_features=111, bias=True)
    (7): Identity()
    (8): Linear(in_features=111, out_features=1, bias=True)
    (9): Softshrink(0.5)
  )
)