RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=38, bias=True)
    (1): Hardsigmoid()
    (2): Linear(in_features=38, out_features=134, bias=True)
    (3): Hardswish()
    (4): Linear(in_features=134, out_features=1, bias=True)
    (5): Hardtanh(min_val=-1.0, max_val=1.0)
  )
)