RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=12, bias=True)
    (1): ELU(alpha=1.0)
    (2): Linear(in_features=12, out_features=99, bias=True)
    (3): PReLU(num_parameters=1)
    (4): Linear(in_features=99, out_features=42, bias=True)
    (5): PReLU(num_parameters=1)
    (6): Linear(in_features=42, out_features=76, bias=True)
    (7): Hardtanh(min_val=-1.0, max_val=1.0)
    (8): Linear(in_features=76, out_features=1, bias=True)
    (9): Tanh()
  )
)