RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=136, bias=True)
    (1): ReLU()
    (2): Linear(in_features=136, out_features=14, bias=True)
    (3): Hardsigmoid()
    (4): Linear(in_features=14, out_features=173, bias=True)
    (5): Hardshrink(0.5)
    (6): Linear(in_features=173, out_features=1, bias=True)
    (7): Tanhshrink()
  )
)