RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=77, bias=True)
    (1): ELU(alpha=1.0)
    (2): Linear(in_features=77, out_features=12, bias=True)
    (3): Softplus(beta=1, threshold=20)
    (4): Linear(in_features=12, out_features=57, bias=True)
    (5): Hardsigmoid()
    (6): Linear(in_features=57, out_features=28, bias=True)
    (7): SELU()
    (8): Linear(in_features=28, out_features=1, bias=True)
    (9): LogSigmoid()
  )
)