RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=27, bias=True)
    (1): SELU()
    (2): Linear(in_features=27, out_features=64, bias=True)
    (3): RReLU(lower=0.125, upper=0.3333333333333333)
    (4): Linear(in_features=64, out_features=89, bias=True)
    (5): Tanhshrink()
    (6): Linear(in_features=89, out_features=113, bias=True)
    (7): Hardswish()
    (8): Linear(in_features=113, out_features=1, bias=True)
    (9): ReLU6()
  )
)