RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=145, bias=True)
    (1): Tanh()
    (2): Linear(in_features=145, out_features=115, bias=True)
    (3): PReLU(num_parameters=1)
    (4): Linear(in_features=115, out_features=74, bias=True)
    (5): LeakyReLU(negative_slope=0.01)
    (6): Linear(in_features=74, out_features=46, bias=True)
    (7): Mish()
    (8): Linear(in_features=46, out_features=1, bias=True)
    (9): Hardshrink(0.5)
  )
)