RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=54, bias=True)
    (1): SiLU()
    (2): Linear(in_features=54, out_features=112, bias=True)
    (3): Softplus(beta=1, threshold=20)
    (4): Linear(in_features=112, out_features=9, bias=True)
    (5): Mish()
    (6): Linear(in_features=9, out_features=1, bias=True)
    (7): LeakyReLU(negative_slope=0.01)
  )
)