RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=57, bias=True)
    (1): Softsign()
    (2): Linear(in_features=57, out_features=148, bias=True)
    (3): Softshrink(0.5)
    (4): Linear(in_features=148, out_features=7, bias=True)
    (5): SELU()
    (6): Linear(in_features=7, out_features=18, bias=True)
    (7): ELU(alpha=1.0)
    (8): Linear(in_features=18, out_features=1, bias=True)
    (9): Hardsigmoid()
  )
)