RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=123, bias=True)
    (1): Hardshrink(0.5)
    (2): Linear(in_features=123, out_features=200, bias=True)
    (3): Softsign()
    (4): Linear(in_features=200, out_features=1, bias=True)
    (5): Softplus(beta=1, threshold=20)
  )
)