RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=18, bias=True)
    (1): CELU(alpha=1.0)
    (2): Linear(in_features=18, out_features=17, bias=True)
    (3): Mish()
    (4): Linear(in_features=17, out_features=1, bias=True)
    (5): Tanh()
  )
)