RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=179, bias=True)
    (1): ReLU6()
    (2): Linear(in_features=179, out_features=11, bias=True)
    (3): GELU(approximate='none')
    (4): Linear(in_features=11, out_features=161, bias=True)
    (5): ReLU()
    (6): Linear(in_features=161, out_features=1, bias=True)
    (7): SiLU()
  )
)