RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=106, bias=True)
    (1): ReLU()
    (2): Linear(in_features=106, out_features=121, bias=True)
    (3): SELU()
    (4): Linear(in_features=121, out_features=5, bias=True)
    (5): Sigmoid()
    (6): Linear(in_features=5, out_features=1, bias=True)
    (7): ReLU()
  )
)