RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=18, bias=True)
    (1): ELU(alpha=1.0)
    (2): Linear(in_features=18, out_features=12, bias=True)
    (3): Mish()
    (4): Linear(in_features=12, out_features=9, bias=True)
    (5): Hardshrink(0.5)
    (6): Linear(in_features=9, out_features=9, bias=True)
    (7): Softplus(beta=1, threshold=20)
    (8): Linear(in_features=9, out_features=1, bias=True)
    (9): Hardswish()
  )
)