RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=139, bias=True)
    (1): Sigmoid()
    (2): Linear(in_features=139, out_features=55, bias=True)
    (3): LeakyReLU(negative_slope=0.01)
    (4): Linear(in_features=55, out_features=1, bias=True)
    (5): GELU(approximate='none')
  )
)