RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=137, bias=True)
    (1): Tanhshrink()
    (2): Linear(in_features=137, out_features=75, bias=True)
    (3): SiLU()
    (4): Linear(in_features=75, out_features=1, bias=True)
    (5): Softsign()
  )
)