RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=110, bias=True)
    (1): Tanhshrink()
    (2): Linear(in_features=110, out_features=62, bias=True)
    (3): ReLU()
    (4): Linear(in_features=62, out_features=3, bias=True)
    (5): Hardsigmoid()
    (6): Linear(in_features=3, out_features=1, bias=True)
    (7): CELU(alpha=1.0)
  )
)