RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=12, bias=True)
    (1): Hardsigmoid()
    (2): Linear(in_features=12, out_features=6, bias=True)
    (3): RReLU(lower=0.125, upper=0.3333333333333333)
    (4): Linear(in_features=6, out_features=140, bias=True)
    (5): LeakyReLU(negative_slope=0.01)
    (6): Linear(in_features=140, out_features=1, bias=True)
    (7): Softshrink(0.5)
  )
)