RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=131, bias=True)
    (1): SELU()
    (2): Linear(in_features=131, out_features=176, bias=True)
    (3): Mish()
    (4): Linear(in_features=176, out_features=1, bias=True)
    (5): Softshrink(0.5)
  )
)