RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=125, bias=True)
    (1): LeakyReLU(negative_slope=0.01)
    (2): Linear(in_features=125, out_features=49, bias=True)
    (3): Softshrink(0.5)
    (4): Linear(in_features=49, out_features=1, bias=True)
    (5): ReLU()
  )
)