RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=79, bias=True)
    (1): PReLU(num_parameters=1)
    (2): Linear(in_features=79, out_features=8, bias=True)
    (3): Tanh()
    (4): Linear(in_features=8, out_features=39, bias=True)
    (5): ReLU()
    (6): Linear(in_features=39, out_features=1, bias=True)
    (7): LeakyReLU(negative_slope=0.01)
  )
)