RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=3, bias=True)
    (1): SiLU()
    (2): Linear(in_features=3, out_features=9, bias=True)
    (3): Softplus(beta=1, threshold=20)
    (4): Linear(in_features=9, out_features=16, bias=True)
    (5): Softsign()
    (6): Linear(in_features=16, out_features=10, bias=True)
    (7): Softsign()
    (8): Linear(in_features=10, out_features=1, bias=True)
    (9): Softshrink(0.5)
  )
)