RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=3, bias=True)
    (1): GELU(approximate='none')
    (2): Linear(in_features=3, out_features=1, bias=True)
    (3): Hardsigmoid()
    (4): Linear(in_features=1, out_features=1, bias=True)
    (5): ELU(alpha=1.0)
  )
)