RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=2, bias=True)
    (1): Identity()
    (2): Linear(in_features=2, out_features=3, bias=True)
    (3): Sigmoid()
    (4): Linear(in_features=3, out_features=3, bias=True)
    (5): CELU(alpha=1.0)
    (6): Linear(in_features=3, out_features=3, bias=True)
    (7): SiLU()
    (8): Linear(in_features=3, out_features=1, bias=True)
    (9): Mish()
  )
)