RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=161, bias=True)
    (1): LeakyReLU(negative_slope=0.01)
    (2): Linear(in_features=161, out_features=17, bias=True)
    (3): Hardsigmoid()
    (4): Linear(in_features=17, out_features=106, bias=True)
    (5): Tanhshrink()
    (6): Linear(in_features=106, out_features=1, bias=True)
    (7): Hardshrink(0.5)
  )
)