RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=2, bias=True)
    (1): SiLU()
    (2): Linear(in_features=2, out_features=3, bias=True)
    (3): Softplus(beta=1, threshold=20)
    (4): Linear(in_features=3, out_features=1, bias=True)
    (5): Tanh()
    (6): Linear(in_features=1, out_features=3, bias=True)
    (7): SELU()
    (8): Linear(in_features=3, out_features=1, bias=True)
    (9): Tanh()
  )
)