RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=117, bias=True)
    (1): ELU(alpha=1.0)
    (2): Linear(in_features=117, out_features=810, bias=True)
    (3): Softplus(beta=1, threshold=20)
    (4): Linear(in_features=810, out_features=940, bias=True)
    (5): Hardsigmoid()
    (6): Linear(in_features=940, out_features=553, bias=True)
    (7): Hardshrink(0.5)
    (8): Linear(in_features=553, out_features=1, bias=True)
    (9): PReLU(num_parameters=1)
  )
)