RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=23, bias=True)
    (1): LeakyReLU(negative_slope=0.01)
    (2): Linear(in_features=23, out_features=44, bias=True)
    (3): Hardswish()
    (4): Linear(in_features=44, out_features=33, bias=True)
    (5): Tanh()
    (6): Linear(in_features=33, out_features=1, bias=True)
    (7): Hardshrink(0.5)
  )
)