RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=71, bias=True)
    (1): Hardshrink(0.5)
    (2): Linear(in_features=71, out_features=50, bias=True)
    (3): Identity()
    (4): Linear(in_features=50, out_features=28, bias=True)
    (5): Tanhshrink()
    (6): Linear(in_features=28, out_features=8, bias=True)
    (7): GELU(approximate='none')
    (8): Linear(in_features=8, out_features=1, bias=True)
    (9): CELU(alpha=1.0)
  )
)