RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=40, bias=True)
    (1): ReLU6()
    (2): Linear(in_features=40, out_features=25, bias=True)
    (3): SiLU()
    (4): Linear(in_features=25, out_features=34, bias=True)
    (5): Tanh()
    (6): Linear(in_features=34, out_features=1, bias=True)
    (7): SiLU()
  )
)