RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=192, bias=True)
    (1): ReLU()
    (2): Linear(in_features=192, out_features=152, bias=True)
    (3): SiLU()
    (4): Linear(in_features=152, out_features=166, bias=True)
    (5): Softplus(beta=1, threshold=20)
    (6): Linear(in_features=166, out_features=139, bias=True)
    (7): Softsign()
    (8): Linear(in_features=139, out_features=1, bias=True)
    (9): Hardshrink(0.5)
  )
)