RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=128, bias=True)
    (1): SiLU()
    (2): Linear(in_features=128, out_features=142, bias=True)
    (3): ReLU6()
    (4): Linear(in_features=142, out_features=198, bias=True)
    (5): RReLU(lower=0.125, upper=0.3333333333333333)
    (6): Linear(in_features=198, out_features=119, bias=True)
    (7): Softshrink(0.5)
    (8): Linear(in_features=119, out_features=1, bias=True)
    (9): Softshrink(0.5)
  )
)