RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=199, bias=True)
    (1): CELU(alpha=1.0)
    (2): Linear(in_features=199, out_features=114, bias=True)
    (3): SELU()
    (4): Linear(in_features=114, out_features=100, bias=True)
    (5): ReLU()
    (6): Linear(in_features=100, out_features=169, bias=True)
    (7): Identity()
    (8): Linear(in_features=169, out_features=1, bias=True)
    (9): Identity()
  )
)