RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=421, bias=True)
    (1): SELU()
    (2): Linear(in_features=421, out_features=482, bias=True)
    (3): PReLU(num_parameters=1)
    (4): Linear(in_features=482, out_features=1, bias=True)
    (5): PReLU(num_parameters=1)
  )
)