RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=406, bias=True)
    (1): Hardtanh(min_val=-1.0, max_val=1.0)
    (2): Linear(in_features=406, out_features=348, bias=True)
    (3): Hardsigmoid()
    (4): Linear(in_features=348, out_features=1, bias=True)
    (5): Tanhshrink()
  )
)