RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=400, bias=True)
    (1): LogSigmoid()
    (2): Linear(in_features=400, out_features=361, bias=True)
    (3): GELU(approximate='none')
    (4): Linear(in_features=361, out_features=354, bias=True)
    (5): Identity()
    (6): Linear(in_features=354, out_features=479, bias=True)
    (7): GELU(approximate='none')
    (8): Linear(in_features=479, out_features=1, bias=True)
    (9): Hardsigmoid()
  )
)