RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=157, bias=True)
    (1): Softsign()
    (2): Linear(in_features=157, out_features=13, bias=True)
    (3): RReLU(lower=0.125, upper=0.3333333333333333)
    (4): Linear(in_features=13, out_features=188, bias=True)
    (5): CELU(alpha=1.0)
    (6): Linear(in_features=188, out_features=1, bias=True)
    (7): Hardswish()
  )
)