RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=89, bias=True)
    (1): Softplus(beta=1, threshold=20)
    (2): Linear(in_features=89, out_features=126, bias=True)
    (3): Tanhshrink()
    (4): Linear(in_features=126, out_features=1, bias=True)
    (5): Sigmoid()
  )
)