RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=726, bias=True)
    (1): Softshrink(0.5)
    (2): Linear(in_features=726, out_features=611, bias=True)
    (3): SELU()
    (4): Linear(in_features=611, out_features=600, bias=True)
    (5): Tanhshrink()
    (6): Linear(in_features=600, out_features=1, bias=True)
    (7): Hardtanh(min_val=-1.0, max_val=1.0)
  )
)