RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=55, bias=True)
    (1): Tanhshrink()
    (2): Linear(in_features=55, out_features=96, bias=True)
    (3): ELU(alpha=1.0)
    (4): Linear(in_features=96, out_features=48, bias=True)
    (5): Softplus(beta=1, threshold=20)
    (6): Linear(in_features=48, out_features=1, bias=True)
    (7): Softshrink(0.5)
  )
)