RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=145, bias=True)
    (1): GELU(approximate='none')
    (2): Linear(in_features=145, out_features=128, bias=True)
    (3): Sigmoid()
    (4): Linear(in_features=128, out_features=125, bias=True)
    (5): Softshrink(0.5)
    (6): Linear(in_features=125, out_features=1, bias=True)
    (7): Softshrink(0.5)
  )
)