RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=8, bias=True)
    (1): Hardshrink(0.5)
    (2): Linear(in_features=8, out_features=9, bias=True)
    (3): Sigmoid()
    (4): Linear(in_features=9, out_features=1, bias=True)
    (5): ELU(alpha=1.0)
  )
)