RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=5, bias=True)
    (1): ReLU6()
    (2): Linear(in_features=5, out_features=1, bias=True)
    (3): Tanh()
    (4): Linear(in_features=1, out_features=1, bias=True)
    (5): PReLU(num_parameters=1)
    (6): Linear(in_features=1, out_features=1, bias=True)
    (7): GELU(approximate='none')
  )
)