RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=3, bias=True)
    (1): GELU(approximate='none')
    (2): Linear(in_features=3, out_features=2, bias=True)
    (3): LogSigmoid()
    (4): Linear(in_features=2, out_features=9, bias=True)
    (5): LogSigmoid()
    (6): Linear(in_features=9, out_features=1, bias=True)
    (7): Tanhshrink()
    (8): Linear(in_features=1, out_features=1, bias=True)
    (9): ReLU()
  )
)