RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=116, bias=True)
    (1): ReLU6()
    (2): Linear(in_features=116, out_features=8, bias=True)
    (3): ReLU6()
    (4): Linear(in_features=8, out_features=1, bias=True)
    (5): Softsign()
  )
)