RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=185, bias=True)
    (1): Tanhshrink()
    (2): Linear(in_features=185, out_features=20, bias=True)
    (3): Softshrink(0.5)
    (4): Linear(in_features=20, out_features=1, bias=True)
    (5): Softplus(beta=1, threshold=20)
  )
)