RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=17, bias=True)
    (1): RReLU(lower=0.125, upper=0.3333333333333333)
    (2): Linear(in_features=17, out_features=146, bias=True)
    (3): Sigmoid()
    (4): Linear(in_features=146, out_features=148, bias=True)
    (5): RReLU(lower=0.125, upper=0.3333333333333333)
    (6): Linear(in_features=148, out_features=1, bias=True)
    (7): LeakyReLU(negative_slope=0.01)
  )
)