RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=6, bias=True)
    (1): Identity()
    (2): Linear(in_features=6, out_features=136, bias=True)
    (3): LogSigmoid()
    (4): Linear(in_features=136, out_features=161, bias=True)
    (5): GELU(approximate='none')
    (6): Linear(in_features=161, out_features=1, bias=True)
    (7): LeakyReLU(negative_slope=0.01)
  )
)