RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=8, bias=True)
    (1): CELU(alpha=1.0)
    (2): Linear(in_features=8, out_features=50, bias=True)
    (3): Mish()
    (4): Linear(in_features=50, out_features=8, bias=True)
    (5): LeakyReLU(negative_slope=0.01)
    (6): Linear(in_features=8, out_features=90, bias=True)
    (7): LeakyReLU(negative_slope=0.01)
    (8): Linear(in_features=90, out_features=1, bias=True)
    (9): Softsign()
  )
)