RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=94, bias=True)
    (1): LogSigmoid()
    (2): Linear(in_features=94, out_features=80, bias=True)
    (3): LeakyReLU(negative_slope=0.01)
    (4): Linear(in_features=80, out_features=56, bias=True)
    (5): CELU(alpha=1.0)
    (6): Linear(in_features=56, out_features=138, bias=True)
    (7): ReLU6()
    (8): Linear(in_features=138, out_features=1, bias=True)
    (9): Identity()
  )
)