RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=77, bias=True)
    (1): RReLU(lower=0.125, upper=0.3333333333333333)
    (2): Linear(in_features=77, out_features=67, bias=True)
    (3): Hardtanh(min_val=-1.0, max_val=1.0)
    (4): Linear(in_features=67, out_features=91, bias=True)
    (5): SiLU()
    (6): Linear(in_features=91, out_features=128, bias=True)
    (7): Identity()
    (8): Linear(in_features=128, out_features=1, bias=True)
    (9): SELU()
  )
)