RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=16, bias=True)
    (1): Tanhshrink()
    (2): Linear(in_features=16, out_features=16, bias=True)
    (3): LogSigmoid()
    (4): Linear(in_features=16, out_features=13, bias=True)
    (5): LogSigmoid()
    (6): Linear(in_features=13, out_features=19, bias=True)
    (7): Sigmoid()
    (8): Linear(in_features=19, out_features=1, bias=True)
    (9): CELU(alpha=1.0)
  )
)