RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=17, bias=True)
    (1): Hardtanh(min_val=-1.0, max_val=1.0)
    (2): Linear(in_features=17, out_features=12, bias=True)
    (3): Identity()
    (4): Linear(in_features=12, out_features=123, bias=True)
    (5): Mish()
    (6): Linear(in_features=123, out_features=167, bias=True)
    (7): ReLU6()
    (8): Linear(in_features=167, out_features=1, bias=True)
    (9): LeakyReLU(negative_slope=0.01)
  )
)