RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=186, bias=True)
    (1): GELU(approximate='none')
    (2): Linear(in_features=186, out_features=104, bias=True)
    (3): Hardtanh(min_val=-1.0, max_val=1.0)
    (4): Linear(in_features=104, out_features=1, bias=True)
    (5): SELU()
  )
)