RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=10, bias=True)
    (1): SELU()
    (2): Linear(in_features=10, out_features=20, bias=True)
    (3): ReLU6()
    (4): Linear(in_features=20, out_features=7, bias=True)
    (5): Hardtanh(min_val=-1.0, max_val=1.0)
    (6): Linear(in_features=7, out_features=181, bias=True)
    (7): ELU(alpha=1.0)
    (8): Linear(in_features=181, out_features=1, bias=True)
    (9): LeakyReLU(negative_slope=0.01)
  )
)