RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=129, bias=True)
    (1): Softplus(beta=1, threshold=20)
    (2): Linear(in_features=129, out_features=128, bias=True)
    (3): CELU(alpha=1.0)
    (4): Linear(in_features=128, out_features=1, bias=True)
    (5): Tanhshrink()
  )
)