RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=75, bias=True)
    (1): ELU(alpha=1.0)
    (2): Linear(in_features=75, out_features=84, bias=True)
    (3): SELU()
    (4): Linear(in_features=84, out_features=128, bias=True)
    (5): GELU(approximate='none')
    (6): Linear(in_features=128, out_features=144, bias=True)
    (7): LogSigmoid()
    (8): Linear(in_features=144, out_features=1, bias=True)
    (9): Hardsigmoid()
  )
)