RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=132, bias=True)
    (1): Identity()
    (2): Linear(in_features=132, out_features=6, bias=True)
    (3): Identity()
    (4): Linear(in_features=6, out_features=13, bias=True)
    (5): LogSigmoid()
    (6): Linear(in_features=13, out_features=139, bias=True)
    (7): ReLU6()
    (8): Linear(in_features=139, out_features=1, bias=True)
    (9): CELU(alpha=1.0)
  )
)