RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=80, bias=True)
    (1): GELU(approximate='none')
    (2): Linear(in_features=80, out_features=4, bias=True)
    (3): Hardswish()
    (4): Linear(in_features=4, out_features=63, bias=True)
    (5): Softshrink(0.5)
    (6): Linear(in_features=63, out_features=76, bias=True)
    (7): ReLU()
    (8): Linear(in_features=76, out_features=1, bias=True)
    (9): ReLU()
  )
)