RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=34, bias=True)
    (1): Softshrink(0.5)
    (2): Linear(in_features=34, out_features=91, bias=True)
    (3): Hardshrink(0.5)
    (4): Linear(in_features=91, out_features=1, bias=True)
    (5): LeakyReLU(negative_slope=0.01)
  )
)