RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=74, bias=True)
    (1): Tanhshrink()
    (2): Linear(in_features=74, out_features=1, bias=True)
    (3): RReLU(lower=0.125, upper=0.3333333333333333)
    (4): Linear(in_features=1, out_features=99, bias=True)
    (5): PReLU(num_parameters=1)
    (6): Linear(in_features=99, out_features=3, bias=True)
    (7): PReLU(num_parameters=1)
    (8): Linear(in_features=3, out_features=1, bias=True)
    (9): Mish()
  )
)