RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=108, bias=True)
    (1): Sigmoid()
    (2): Linear(in_features=108, out_features=16, bias=True)
    (3): ELU(alpha=1.0)
    (4): Linear(in_features=16, out_features=69, bias=True)
    (5): Hardswish()
    (6): Linear(in_features=69, out_features=1, bias=True)
    (7): Hardshrink(0.5)
  )
)