RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=113, bias=True)
    (1): Tanhshrink()
    (2): Linear(in_features=113, out_features=111, bias=True)
    (3): Tanh()
    (4): Linear(in_features=111, out_features=1, bias=True)
    (5): Tanhshrink()
  )
)