RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=19, bias=True)
    (1): Tanhshrink()
    (2): Linear(in_features=19, out_features=170, bias=True)
    (3): Tanhshrink()
    (4): Linear(in_features=170, out_features=135, bias=True)
    (5): Hardshrink(0.5)
    (6): Linear(in_features=135, out_features=6, bias=True)
    (7): ReLU()
    (8): Linear(in_features=6, out_features=1, bias=True)
    (9): Mish()
  )
)