RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=13, bias=True)
    (1): Tanh()
    (2): Linear(in_features=13, out_features=180, bias=True)
    (3): Tanhshrink()
    (4): Linear(in_features=180, out_features=156, bias=True)
    (5): Hardsigmoid()
    (6): Linear(in_features=156, out_features=1, bias=True)
    (7): SELU()
  )
)