RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=6, bias=True)
    (1): Hardsigmoid()
    (2): Linear(in_features=6, out_features=16, bias=True)
    (3): PReLU(num_parameters=1)
    (4): Linear(in_features=16, out_features=50, bias=True)
    (5): Hardswish()
    (6): Linear(in_features=50, out_features=24, bias=True)
    (7): Softplus(beta=1, threshold=20)
    (8): Linear(in_features=24, out_features=1, bias=True)
    (9): Tanhshrink()
  )
)