RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=76, bias=True)
    (1): SELU()
    (2): Linear(in_features=76, out_features=86, bias=True)
    (3): Hardswish()
    (4): Linear(in_features=86, out_features=1, bias=True)
    (5): Tanhshrink()
  )
)