RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=24, bias=True)
    (1): Sigmoid()
    (2): Linear(in_features=24, out_features=39, bias=True)
    (3): Sigmoid()
    (4): Linear(in_features=39, out_features=20, bias=True)
    (5): Sigmoid()
    (6): Linear(in_features=20, out_features=1, bias=True)
    (7): Hardsigmoid()
  )
)