RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=59, bias=True)
    (1): Softplus(beta=1, threshold=20)
    (2): Linear(in_features=59, out_features=44, bias=True)
    (3): Softsign()
    (4): Linear(in_features=44, out_features=97, bias=True)
    (5): LogSigmoid()
    (6): Linear(in_features=97, out_features=1, bias=True)
    (7): Softshrink(0.5)
  )
)