RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=84, bias=True)
    (1): PReLU(num_parameters=1)
    (2): Linear(in_features=84, out_features=48, bias=True)
    (3): GELU(approximate='none')
    (4): Linear(in_features=48, out_features=6, bias=True)
    (5): SiLU()
    (6): Linear(in_features=6, out_features=1, bias=True)
    (7): Tanh()
  )
)