RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=5, bias=True)
    (1): PReLU(num_parameters=1)
    (2): Linear(in_features=5, out_features=92, bias=True)
    (3): Hardshrink(0.5)
    (4): Linear(in_features=92, out_features=1, bias=True)
    (5): PReLU(num_parameters=1)
  )
)