RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=70, bias=True)
    (1): LeakyReLU(negative_slope=0.01)
    (2): Linear(in_features=70, out_features=39, bias=True)
    (3): Hardtanh(min_val=-1.0, max_val=1.0)
    (4): Linear(in_features=39, out_features=34, bias=True)
    (5): Hardtanh(min_val=-1.0, max_val=1.0)
    (6): Linear(in_features=34, out_features=1, bias=True)
    (7): Identity()
  )
)