RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=33, bias=True)
    (1): Mish()
    (2): Linear(in_features=33, out_features=91, bias=True)
    (3): ReLU()
    (4): Linear(in_features=91, out_features=38, bias=True)
    (5): Tanh()
    (6): Linear(in_features=38, out_features=91, bias=True)
    (7): PReLU(num_parameters=1)
    (8): Linear(in_features=91, out_features=1, bias=True)
    (9): ReLU6()
  )
)