RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=13, bias=True)
    (1): CELU(alpha=1.0)
    (2): Linear(in_features=13, out_features=15, bias=True)
    (3): Softplus(beta=1, threshold=20)
    (4): Linear(in_features=15, out_features=85, bias=True)
    (5): ELU(alpha=1.0)
    (6): Linear(in_features=85, out_features=1, bias=True)
    (7): Softsign()
  )
)