RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=6, bias=True)
    (1): LogSigmoid()
    (2): Linear(in_features=6, out_features=69, bias=True)
    (3): SiLU()
    (4): Linear(in_features=69, out_features=1, bias=True)
    (5): RReLU(lower=0.125, upper=0.3333333333333333)
  )
)