RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=102, bias=True)
    (1): LogSigmoid()
    (2): Linear(in_features=102, out_features=6, bias=True)
    (3): Hardtanh(min_val=-1.0, max_val=1.0)
    (4): Linear(in_features=6, out_features=1, bias=True)
    (5): SiLU()
  )
)