RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=18, bias=True)
    (1): RReLU(lower=0.125, upper=0.3333333333333333)
    (2): Linear(in_features=18, out_features=11, bias=True)
    (3): LogSigmoid()
    (4): Linear(in_features=11, out_features=16, bias=True)
    (5): CELU(alpha=1.0)
    (6): Linear(in_features=16, out_features=12, bias=True)
    (7): Hardshrink(0.5)
    (8): Linear(in_features=12, out_features=1, bias=True)
    (9): ELU(alpha=1.0)
  )
)