RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=6, bias=True)
    (1): ELU(alpha=1.0)
    (2): Linear(in_features=6, out_features=8, bias=True)
    (3): LeakyReLU(negative_slope=0.01)
    (4): Linear(in_features=8, out_features=14, bias=True)
    (5): Softshrink(0.5)
    (6): Linear(in_features=14, out_features=24, bias=True)
    (7): Softshrink(0.5)
    (8): Linear(in_features=24, out_features=1, bias=True)
    (9): SiLU()
  )
)