RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=7, bias=True)
    (1): Softplus(beta=1, threshold=20)
    (2): Linear(in_features=7, out_features=195, bias=True)
    (3): ReLU()
    (4): Linear(in_features=195, out_features=174, bias=True)
    (5): Tanhshrink()
    (6): Linear(in_features=174, out_features=108, bias=True)
    (7): SELU()
    (8): Linear(in_features=108, out_features=1, bias=True)
    (9): RReLU(lower=0.125, upper=0.3333333333333333)
  )
)