RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=170, bias=True)
    (1): Mish()
    (2): Linear(in_features=170, out_features=179, bias=True)
    (3): Tanh()
    (4): Linear(in_features=179, out_features=1, bias=True)
    (5): Hardswish()
  )
)