RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=153, bias=True)
    (1): Hardsigmoid()
    (2): Linear(in_features=153, out_features=7, bias=True)
    (3): ReLU6()
    (4): Linear(in_features=7, out_features=1, bias=True)
    (5): RReLU(lower=0.125, upper=0.3333333333333333)
  )
)