RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=12, bias=True)
    (1): Mish()
    (2): Linear(in_features=12, out_features=9, bias=True)
    (3): Softshrink(0.5)
    (4): Linear(in_features=9, out_features=11, bias=True)
    (5): Tanhshrink()
    (6): Linear(in_features=11, out_features=15, bias=True)
    (7): Softshrink(0.5)
    (8): Linear(in_features=15, out_features=1, bias=True)
    (9): Mish()
  )
)