RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=13, bias=True)
    (1): Hardshrink(0.5)
    (2): Linear(in_features=13, out_features=147, bias=True)
    (3): Softplus(beta=1, threshold=20)
    (4): Linear(in_features=147, out_features=84, bias=True)
    (5): SiLU()
    (6): Linear(in_features=84, out_features=11, bias=True)
    (7): Softplus(beta=1, threshold=20)
    (8): Linear(in_features=11, out_features=1, bias=True)
    (9): CELU(alpha=1.0)
  )
)