RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=7, bias=True)
    (1): Tanhshrink()
    (2): Linear(in_features=7, out_features=17, bias=True)
    (3): Sigmoid()
    (4): Linear(in_features=17, out_features=142, bias=True)
    (5): SiLU()
    (6): Linear(in_features=142, out_features=12, bias=True)
    (7): Hardsigmoid()
    (8): Linear(in_features=12, out_features=1, bias=True)
    (9): Hardswish()
  )
)