RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=33, bias=True)
    (1): Hardswish()
    (2): Linear(in_features=33, out_features=72, bias=True)
    (3): SiLU()
    (4): Linear(in_features=72, out_features=1, bias=True)
    (5): LogSigmoid()
  )
)