RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=93, bias=True)
    (1): CELU(alpha=1.0)
    (2): Linear(in_features=93, out_features=89, bias=True)
    (3): GELU(approximate='none')
    (4): Linear(in_features=89, out_features=75, bias=True)
    (5): Softplus(beta=1, threshold=20)
    (6): Linear(in_features=75, out_features=1, bias=True)
    (7): CELU(alpha=1.0)
  )
)