RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=9, bias=True)
    (1): ReLU()
    (2): Linear(in_features=9, out_features=5, bias=True)
    (3): Hardsigmoid()
    (4): Linear(in_features=5, out_features=3, bias=True)
    (5): Softsign()
    (6): Linear(in_features=3, out_features=87, bias=True)
    (7): Hardsigmoid()
    (8): Linear(in_features=87, out_features=1, bias=True)
    (9): Tanhshrink()
  )
)