RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=1, bias=True)
    (1): ReLU()
    (2): Linear(in_features=1, out_features=6, bias=True)
    (3): Tanh()
    (4): Linear(in_features=6, out_features=2, bias=True)
    (5): CELU(alpha=1.0)
    (6): Linear(in_features=2, out_features=1, bias=True)
    (7): Tanhshrink()
  )
)