RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=14, bias=True)
    (1): GELU(approximate='none')
    (2): Linear(in_features=14, out_features=5, bias=True)
    (3): Mish()
    (4): Linear(in_features=5, out_features=1, bias=True)
    (5): Tanhshrink()
  )
)