RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=12, bias=True)
    (1): GELU(approximate='none')
    (2): Linear(in_features=12, out_features=77, bias=True)
    (3): SELU()
    (4): Linear(in_features=77, out_features=1, bias=True)
    (5): CELU(alpha=1.0)
  )
)