RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=13, bias=True)
    (1): Hardshrink(0.5)
    (2): Linear(in_features=13, out_features=15, bias=True)
    (3): SiLU()
    (4): Linear(in_features=15, out_features=1, bias=True)
    (5): Hardtanh(min_val=-1.0, max_val=1.0)
  )
)