RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=84, bias=True)
    (1): Softplus(beta=1, threshold=20)
    (2): Linear(in_features=84, out_features=97, bias=True)
    (3): Tanh()
    (4): Linear(in_features=97, out_features=2, bias=True)
    (5): Softshrink(0.5)
    (6): Linear(in_features=2, out_features=13, bias=True)
    (7): SELU()
    (8): Linear(in_features=13, out_features=1, bias=True)
    (9): SELU()
  )
)