RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=140, bias=True)
    (1): Hardswish()
    (2): Linear(in_features=140, out_features=5, bias=True)
    (3): PReLU(num_parameters=1)
    (4): Linear(in_features=5, out_features=1, bias=True)
    (5): PReLU(num_parameters=1)
  )
)