RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=77, bias=True)
    (1): Hardtanh(min_val=-1.0, max_val=1.0)
    (2): Linear(in_features=77, out_features=5, bias=True)
    (3): GELU(approximate='none')
    (4): Linear(in_features=5, out_features=53, bias=True)
    (5): Softplus(beta=1, threshold=20)
    (6): Linear(in_features=53, out_features=68, bias=True)
    (7): Tanh()
    (8): Linear(in_features=68, out_features=1, bias=True)
    (9): SiLU()
  )
)