RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=49, bias=True)
    (1): Tanh()
    (2): Linear(in_features=49, out_features=81, bias=True)
    (3): PReLU(num_parameters=1)
    (4): Linear(in_features=81, out_features=1, bias=True)
    (5): Tanhshrink()
  )
)