RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=20, bias=True)
    (1): Sigmoid()
    (2): Linear(in_features=20, out_features=83, bias=True)
    (3): Softshrink(0.5)
    (4): Linear(in_features=83, out_features=23, bias=True)
    (5): Sigmoid()
    (6): Linear(in_features=23, out_features=1, bias=True)
    (7): Softsign()
  )
)