RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=145, bias=True)
    (1): Softshrink(0.5)
    (2): Linear(in_features=145, out_features=16, bias=True)
    (3): SiLU()
    (4): Linear(in_features=16, out_features=100, bias=True)
    (5): Mish()
    (6): Linear(in_features=100, out_features=1, bias=True)
    (7): Mish()
  )
)