RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=146, bias=True)
    (1): PReLU(num_parameters=1)
    (2): Linear(in_features=146, out_features=65, bias=True)
    (3): Mish()
    (4): Linear(in_features=65, out_features=143, bias=True)
    (5): Hardsigmoid()
    (6): Linear(in_features=143, out_features=1, bias=True)
    (7): Tanhshrink()
  )
)