RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=90, bias=True)
    (1): Tanhshrink()
    (2): Linear(in_features=90, out_features=44, bias=True)
    (3): RReLU(lower=0.125, upper=0.3333333333333333)
    (4): Linear(in_features=44, out_features=55, bias=True)
    (5): Softsign()
    (6): Linear(in_features=55, out_features=100, bias=True)
    (7): SELU()
    (8): Linear(in_features=100, out_features=1, bias=True)
    (9): Identity()
  )
)