RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=42, bias=True)
    (1): Hardtanh(min_val=-1.0, max_val=1.0)
    (2): Linear(in_features=42, out_features=59, bias=True)
    (3): PReLU(num_parameters=1)
    (4): Linear(in_features=59, out_features=94, bias=True)
    (5): Softsign()
    (6): Linear(in_features=94, out_features=30, bias=True)
    (7): ELU(alpha=1.0)
    (8): Linear(in_features=30, out_features=1, bias=True)
    (9): LogSigmoid()
  )
)