RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=3, bias=True)
    (1): Hardsigmoid()
    (2): Linear(in_features=3, out_features=99, bias=True)
    (3): Softplus(beta=1, threshold=20)
    (4): Linear(in_features=99, out_features=7, bias=True)
    (5): Sigmoid()
    (6): Linear(in_features=7, out_features=88, bias=True)
    (7): Tanhshrink()
    (8): Linear(in_features=88, out_features=1, bias=True)
    (9): Softshrink(0.5)
  )
)