RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=186, bias=True)
    (1): LeakyReLU(negative_slope=0.01)
    (2): Linear(in_features=186, out_features=16, bias=True)
    (3): Tanh()
    (4): Linear(in_features=16, out_features=1, bias=True)
    (5): Softplus(beta=1, threshold=20)
  )
)