RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=11, bias=True)
    (1): ReLU6()
    (2): Linear(in_features=11, out_features=16, bias=True)
    (3): ELU(alpha=1.0)
    (4): Linear(in_features=16, out_features=172, bias=True)
    (5): Tanhshrink()
    (6): Linear(in_features=172, out_features=1, bias=True)
    (7): Hardsigmoid()
  )
)