RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=106, bias=True)
    (1): ReLU()
    (2): Linear(in_features=106, out_features=82, bias=True)
    (3): Mish()
    (4): Linear(in_features=82, out_features=97, bias=True)
    (5): Hardtanh(min_val=-1.0, max_val=1.0)
    (6): Linear(in_features=97, out_features=3, bias=True)
    (7): PReLU(num_parameters=1)
    (8): Linear(in_features=3, out_features=1, bias=True)
    (9): Hardshrink(0.5)
  )
)