RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=94, bias=True)
    (1): Hardsigmoid()
    (2): Linear(in_features=94, out_features=98, bias=True)
    (3): ELU(alpha=1.0)
    (4): Linear(in_features=98, out_features=84, bias=True)
    (5): Tanhshrink()
    (6): Linear(in_features=84, out_features=1, bias=True)
    (7): ReLU6()
  )
)