RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=26, bias=True)
    (1): Hardswish()
    (2): Linear(in_features=26, out_features=119, bias=True)
    (3): Softshrink(0.5)
    (4): Linear(in_features=119, out_features=87, bias=True)
    (5): Tanh()
    (6): Linear(in_features=87, out_features=71, bias=True)
    (7): Tanh()
    (8): Linear(in_features=71, out_features=1, bias=True)
    (9): ReLU6()
  )
)