RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=11, bias=True)
    (1): LeakyReLU(negative_slope=0.01)
    (2): Linear(in_features=11, out_features=7, bias=True)
    (3): Sigmoid()
    (4): Linear(in_features=7, out_features=97, bias=True)
    (5): Softplus(beta=1, threshold=20)
    (6): Linear(in_features=97, out_features=88, bias=True)
    (7): LogSigmoid()
    (8): Linear(in_features=88, out_features=1, bias=True)
    (9): LogSigmoid()
  )
)