RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=16, bias=True)
    (1): Sigmoid()
    (2): Linear(in_features=16, out_features=9, bias=True)
    (3): Softsign()
    (4): Linear(in_features=9, out_features=187, bias=True)
    (5): Softsign()
    (6): Linear(in_features=187, out_features=13, bias=True)
    (7): PReLU(num_parameters=1)
    (8): Linear(in_features=13, out_features=1, bias=True)
    (9): CELU(alpha=1.0)
  )
)