RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=106, bias=True)
    (1): ReLU()
    (2): Linear(in_features=106, out_features=139, bias=True)
    (3): Softsign()
    (4): Linear(in_features=139, out_features=21, bias=True)
    (5): ELU(alpha=1.0)
    (6): Linear(in_features=21, out_features=89, bias=True)
    (7): Hardtanh(min_val=-1.0, max_val=1.0)
    (8): Linear(in_features=89, out_features=1, bias=True)
    (9): Sigmoid()
  )
)