RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=77, bias=True)
    (1): Identity()
    (2): Linear(in_features=77, out_features=5, bias=True)
    (3): RReLU(lower=0.125, upper=0.3333333333333333)
    (4): Linear(in_features=5, out_features=115, bias=True)
    (5): Softsign()
    (6): Linear(in_features=115, out_features=9, bias=True)
    (7): Identity()
    (8): Linear(in_features=9, out_features=1, bias=True)
    (9): SiLU()
  )
)