RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=19, bias=True)
    (1): Softshrink(0.5)
    (2): Linear(in_features=19, out_features=139, bias=True)
    (3): SiLU()
    (4): Linear(in_features=139, out_features=14, bias=True)
    (5): Softsign()
    (6): Linear(in_features=14, out_features=1, bias=True)
    (7): Sigmoid()
  )
)