RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=20, bias=True)
    (1): Tanh()
    (2): Linear(in_features=20, out_features=158, bias=True)
    (3): ELU(alpha=1.0)
    (4): Linear(in_features=158, out_features=114, bias=True)
    (5): Hardswish()
    (6): Linear(in_features=114, out_features=1, bias=True)
    (7): ELU(alpha=1.0)
  )
)