RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=47, bias=True)
    (1): Hardsigmoid()
    (2): Linear(in_features=47, out_features=75, bias=True)
    (3): Hardshrink(0.5)
    (4): Linear(in_features=75, out_features=1, bias=True)
    (5): GELU(approximate='none')
  )
)