RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=88, bias=True)
    (1): SiLU()
    (2): Linear(in_features=88, out_features=35, bias=True)
    (3): Mish()
    (4): Linear(in_features=35, out_features=19, bias=True)
    (5): CELU(alpha=1.0)
    (6): Linear(in_features=19, out_features=50, bias=True)
    (7): RReLU(lower=0.125, upper=0.3333333333333333)
    (8): Linear(in_features=50, out_features=1, bias=True)
    (9): GELU(approximate='none')
  )
)