RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=9, bias=True)
    (1): Hardshrink(0.5)
    (2): Linear(in_features=9, out_features=24, bias=True)
    (3): Hardshrink(0.5)
    (4): Linear(in_features=24, out_features=93, bias=True)
    (5): Tanh()
    (6): Linear(in_features=93, out_features=113, bias=True)
    (7): SELU()
    (8): Linear(in_features=113, out_features=1, bias=True)
    (9): LogSigmoid()
  )
)