RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=19, bias=True)
    (1): Hardtanh(min_val=-1.0, max_val=1.0)
    (2): Linear(in_features=19, out_features=125, bias=True)
    (3): Mish()
    (4): Linear(in_features=125, out_features=106, bias=True)
    (5): Sigmoid()
    (6): Linear(in_features=106, out_features=1, bias=True)
    (7): Mish()
  )
)