RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=166, bias=True)
    (1): ELU(alpha=1.0)
    (2): Linear(in_features=166, out_features=196, bias=True)
    (3): LeakyReLU(negative_slope=0.01)
    (4): Linear(in_features=196, out_features=16, bias=True)
    (5): Hardtanh(min_val=-1.0, max_val=1.0)
    (6): Linear(in_features=16, out_features=162, bias=True)
    (7): Softsign()
    (8): Linear(in_features=162, out_features=1, bias=True)
    (9): Tanh()
  )
)