RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=162, bias=True)
    (1): Hardtanh(min_val=-1.0, max_val=1.0)
    (2): Linear(in_features=162, out_features=179, bias=True)
    (3): Softshrink(0.5)
    (4): Linear(in_features=179, out_features=10, bias=True)
    (5): Tanh()
    (6): Linear(in_features=10, out_features=107, bias=True)
    (7): Identity()
    (8): Linear(in_features=107, out_features=1, bias=True)
    (9): Sigmoid()
  )
)