RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=14, bias=True)
    (1): GELU(approximate='none')
    (2): Linear(in_features=14, out_features=17, bias=True)
    (3): ELU(alpha=1.0)
    (4): Linear(in_features=17, out_features=143, bias=True)
    (5): Softshrink(0.5)
    (6): Linear(in_features=143, out_features=8, bias=True)
    (7): Hardswish()
    (8): Linear(in_features=8, out_features=1, bias=True)
    (9): ELU(alpha=1.0)
  )
)