RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=167, bias=True)
    (1): Softplus(beta=1, threshold=20)
    (2): Linear(in_features=167, out_features=156, bias=True)
    (3): Tanhshrink()
    (4): Linear(in_features=156, out_features=7, bias=True)
    (5): Hardtanh(min_val=-1.0, max_val=1.0)
    (6): Linear(in_features=7, out_features=1, bias=True)
    (7): Hardswish()
  )
)