RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=8, bias=True)
    (1): Softplus(beta=1, threshold=20)
    (2): Linear(in_features=8, out_features=15, bias=True)
    (3): CELU(alpha=1.0)
    (4): Linear(in_features=15, out_features=116, bias=True)
    (5): SELU()
    (6): Linear(in_features=116, out_features=1, bias=True)
    (7): CELU(alpha=1.0)
  )
)