RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=91, bias=True)
    (1): RReLU(lower=0.125, upper=0.3333333333333333)
    (2): Linear(in_features=91, out_features=142, bias=True)
    (3): Softsign()
    (4): Linear(in_features=142, out_features=118, bias=True)
    (5): Hardsigmoid()
    (6): Linear(in_features=118, out_features=76, bias=True)
    (7): Softshrink(0.5)
    (8): Linear(in_features=76, out_features=1, bias=True)
    (9): Identity()
  )
)