RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=58, bias=True)
    (1): LogSigmoid()
    (2): Linear(in_features=58, out_features=40, bias=True)
    (3): Tanhshrink()
    (4): Linear(in_features=40, out_features=121, bias=True)
    (5): ReLU6()
    (6): Linear(in_features=121, out_features=1, bias=True)
    (7): Sigmoid()
  )
)