RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=98, bias=True)
    (1): Mish()
    (2): Linear(in_features=98, out_features=60, bias=True)
    (3): Softsign()
    (4): Linear(in_features=60, out_features=32, bias=True)
    (5): Hardswish()
    (6): Linear(in_features=32, out_features=1, bias=True)
    (7): SELU()
  )
)