RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=138, bias=True)
    (1): ReLU()
    (2): Linear(in_features=138, out_features=128, bias=True)
    (3): SiLU()
    (4): Linear(in_features=128, out_features=129, bias=True)
    (5): CELU(alpha=1.0)
    (6): Linear(in_features=129, out_features=1, bias=True)
    (7): Tanhshrink()
  )
)