RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=10, bias=True)
    (1): Sigmoid()
    (2): Linear(in_features=10, out_features=154, bias=True)
    (3): SELU()
    (4): Linear(in_features=154, out_features=19, bias=True)
    (5): Sigmoid()
    (6): Linear(in_features=19, out_features=142, bias=True)
    (7): CELU(alpha=1.0)
    (8): Linear(in_features=142, out_features=1, bias=True)
    (9): SELU()
  )
)