RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=89, bias=True)
    (1): Tanhshrink()
    (2): Linear(in_features=89, out_features=10, bias=True)
    (3): Hardtanh(min_val=-1.0, max_val=1.0)
    (4): Linear(in_features=10, out_features=5, bias=True)
    (5): Hardswish()
    (6): Linear(in_features=5, out_features=100, bias=True)
    (7): Softsign()
    (8): Linear(in_features=100, out_features=1, bias=True)
    (9): Sigmoid()
  )
)