RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=59, bias=True)
    (1): Mish()
    (2): Linear(in_features=59, out_features=145, bias=True)
    (3): SiLU()
    (4): Linear(in_features=145, out_features=1, bias=True)
    (5): GELU(approximate='none')
  )
)