RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=146, bias=True)
    (1): Tanhshrink()
    (2): Linear(in_features=146, out_features=122, bias=True)
    (3): Mish()
    (4): Linear(in_features=122, out_features=16, bias=True)
    (5): ReLU()
    (6): Linear(in_features=16, out_features=1, bias=True)
    (7): Hardswish()
  )
)