RandomNetwork(
  (layers): Sequential(
    (0): Linear(in_features=3, out_features=181, bias=True)
    (1): GELU(approximate='none')
    (2): Linear(in_features=181, out_features=6, bias=True)
    (3): Identity()
    (4): Linear(in_features=6, out_features=1, bias=True)
    (5): Mish()
  )
)